driver-tests/bpelse/xpathfunctions/DateTimeComparison/DateTimeComparisionCompApp/test/dateTimeComparisons/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:new="http://j2ee.netbeans.org/wsdl/BpelModule1/newWSDL">
  <soapenv:Body>
    <new:newWSDLOperation>
      <dateTime1>2008-09-28T18:49:44</dateTime1>
      <dateTime2>2008-09-28T18:49:45</dateTime2>
      <date1>2006-08-20-07:00</date1>
      <date2>2006-08-19-07:00</date2>
      <time1>17:18:36-07:00</time1>
      <time2>17:18:37-07:00</time2>
    </new:newWSDLOperation>
  </soapenv:Body>
</soapenv:Envelope>